name: "visual-segmenter"
max_batch_size: 4
input {
  name: "image"
  data_type: TYPE_UINT8
  dims: -1
  dims: -1
  dims: 3
}
output {
  name: "predicted_mask"
  data_type: TYPE_INT64
  dims: -1
  dims: -1
  label_filename: "labels.txt"
}
instance_group {
  count: 1
  kind: KIND_CPU # Use CPU only for test
}
dynamic_batching {
  max_queue_delay_microseconds: 500
}
backend: "python"
