name: "text-embedder"
max_batch_size: 4
input {
  name: "text"
  data_type: TYPE_STRING
  dims: 1
}
output {
  name: "embeddings"
  data_type: TYPE_FP32
  dims: -1
}
instance_group {
  count: 1
  kind: KIND_CPU # Use CPU only for test
}
dynamic_batching {
  max_queue_delay_microseconds: 500
}
backend: "python"
