name: "xlm-roberta"
max_batch_size: 2
input {
  name: "text"
  data_type: TYPE_STRING
  dims: 1
}
output {
  name: "softmax_predictions"
  data_type: TYPE_FP32
  dims: -1
  label_filename: "labels.txt"
}
instance_group {
  count: 1
  kind: KIND_GPU
}
dynamic_batching {
  max_queue_delay_microseconds: 500
}
backend: "python"
